# PROGRAMMING SCHOOL

### Reading datas

In [42]:
import pandas as pd

In [43]:
name_f = pd.read_json('https://guilhermeonrails.github.io/nomes_ibge/nomes-f.json')
name_m = pd.read_json('https://guilhermeonrails.github.io/nomes_ibge/nomes-m.json')

In [47]:
name_f =name_f.rename(columns={'nome':'name', 'regiao':'region', 'freq':'freq', 'rank':'rank', 'sexo':'sex'})
name_m =name_f.rename(columns={'nome':'name', 'regiao':'region', 'freq':'freq', 'rank':'rank', 'sexo':'sex'})

In [48]:
name_f.head()

        name  region      freq  rank sex
0      MARIA       0  11694738     1   F
1        ANA       0   3079729     2   F
2  FRANCISCA       0    721637     3   F
3    ANTONIA       0    588783     4   F
4    ADRIANA       0    565621     5   F

In [49]:
name_m.head()

        name  region      freq  rank sex
0      MARIA       0  11694738     1   F
1        ANA       0   3079729     2   F
2  FRANCISCA       0    721637     3   F
3    ANTONIA       0    588783     4   F
4    ADRIANA       0    565621     5   F

### Sample in pandas

To perform random sampling. The number of samples to extract can be expressed in two alternative ways: specify the exact number of random rows to extract.
Returns a random sample row from the DataFrame.

In [9]:
name_m.sample(5)

         nome  regiao    freq  rank sexo
161    DAMIAO       0   79047   162    M
85   FABRICIO       0  166678    86    M
126    MURILO       0  115067   127    M
160    MOACIR       0   79629   161    M
184    ALISON       0   72186   185    M

In [50]:
print('Number of Names:' + str(len(name_f) + len(name_m)))

Number of Names:400

Now we want to merge these two sets into a single dataframe containing the names of all students in the school. For this, we will create a variable frames that will receive a list containing our information.

In [51]:
frames = [name_f, name_m]
frames

[          name  region      freq  rank sex
 0        MARIA       0  11694738     1   F
 1          ANA       0   3079729     2   F
 2    FRANCISCA       0    721637     3   F
 3      ANTONIA       0    588783     4   F
 4      ADRIANA       0    565621     5   F
 ..         ...     ...       ...   ...  ..
 195     ROSANE       0     82203   196   F
 196    IVONETE       0     81878   197   F
 197    LUCIANE       0     81230   198   F
 198    ISADORA       0     81100   199   F
 199      NILZA       0     80128   200   F

 [200 rows x 5 columns],
           name  region      freq  rank sex
 0        MARIA       0  11694738     1   F
 1          ANA       0   3079729     2   F
 2    FRANCISCA       0    721637     3   F
 3      ANTONIA       0    588783     4   F
 4      ADRIANA       0    565621     5   F
 ..         ...     ...       ...   ...  ..
 195     ROSANE       0     82203   196   F
 196    IVONETE       0     81878   197   F
 197    LUCIANE       0     81230   198   F
 198    ISADORA       0     81100   199   F
 199      NILZA       0     80128   200   F

 [200 rows x 5 columns]]

In [28]:
frames

[          nome  regiao      freq  rank sexo
 0        MARIA       0  11694738     1    F
 1          ANA       0   3079729     2    F
 2    FRANCISCA       0    721637     3    F
 3      ANTONIA       0    588783     4    F
 4      ADRIANA       0    565621     5    F
 ..         ...     ...       ...   ...  ...
 195     ROSANE       0     82203   196    F
 196    IVONETE       0     81878   197    F
 197    LUCIANE       0     81230   198    F
 198    ISADORA       0     81100   199    F
 199      NILZA       0     80128   200    F

 [200 rows x 5 columns],
           nome  regiao     freq  rank sexo
 0         JOSE       0  5732508     1    M
 1         JOAO       0  2971935     2    M
 2      ANTONIO       0  2567494     3    M
 3    FRANCISCO       0  1765197     4    M
 4       CARLOS       0  1483121     5    M
 ..         ...     ...      ...   ...  ...
 195     WALTER       0    67207   196    M
 196    ARLINDO       0    66669   197    M
 197    MICHAEL       0    65736   198    M
 198     ALVARO       0    65444   199    M
 199    GEOVANE       0    65435   200    M

 [200 rows x 5 columns]]

In the pd.concat() function, it is possible to specify which columns we want to concatenate, in this case just the name. At the end, we will use the to_frame() function to transform the resulting set into a dataframe.

pd.concat(frames)['nome'].to_frame()